samples/personal-info/out/rdra_buc_buccard.mmd
graph TD
  User(["👤 User"])
  DeleteCard(["Delete Card"])
  ListCards(["List Cards"])
  RegisterCard(["Register Card"])
  SetPrimaryCard(["Set Primary Card"])
  BucCard["📦 Manage Credit Cards"]
  AuditLog[("🗄 Audit Log")]
  CreditCard[("🗄 Credit Card")]
  CardAddScreen[["Card Registration Screen"]]
  CardListScreen[["Card List Screen"]]
  User --> BucCard
  BucCard --> PersonalDataMgmt
  BucCard --> SetPrimaryCard
  BucCard --> ListCards
  BucCard --> RegisterCard
  BucCard --> DeleteCard
  SetPrimaryCard -.->|displays| CardListScreen
  ListCards -.->|displays| CardListScreen
  RegisterCard -.->|displays| CardAddScreen
  DeleteCard -.->|displays| CardListScreen
