samples/personal-info/out/rdra_buc_card.puml
@startuml
!theme plain

actor "User" as User

usecase "Delete Card" as DeleteCard
usecase "List Cards" as ListCards
usecase "Register Card" as RegisterCard
usecase "Set Primary Card" as SetPrimaryCard

rectangle "Manage Credit Cards" as BucCard



database "Audit Log" as AuditLog
database "Credit Card" as CreditCard

boundary "Card Registration Screen" as CardAddScreen
boundary "Card List Screen" as CardListScreen



User --> BucCard
BucCard ..> PersonalDataMgmt : belongs
BucCard ..> SetPrimaryCard : contains
BucCard ..> ListCards : contains
BucCard ..> RegisterCard : contains
BucCard ..> DeleteCard : contains
SetPrimaryCard ..> CardListScreen : displays
ListCards ..> CardListScreen : displays
RegisterCard ..> CardAddScreen : displays
DeleteCard ..> CardListScreen : displays
@enduml
